//---10% от введенного числа:----------------

// const num = prompt("Your number")
// console.log("10% your number is - " + num * 0.1)
//=============================================================

//---программа, которая получает два числа и выводит наименьшее:-----

// const a = prompt("Write first number")
// const b = prompt("Write second number")

// if (a < b) {
//     console.log(a)    
// } else {
//     console.log(b)
// }
//==============================================================

//--- программа, которая считывает через prompt число и выводит одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или ‘Число равно 100’:--------------------------------------------------------






