// 1.Напишите функцию, которая принимает два числа и возвращает большее из них.

// const getMaxNum = (a, b) => 
//      Math.max(a, b)
     
// console.log(getMaxNum(23, 4580)) 
//---------------------------------------------------------------------

// 2.Напишите функцию, которая принимает число и возвращает его квадрат.

// const exponent = (a, b) =>
//       Math.pow(a, b)

// console.log(exponent(4, 6))    
//----------------------------------------------------------------------

// 3.Напишите функцию, которая принимает строку и возвращает ее длину.

//  const isLength = (str) => 
//  str.length  

//  console.log(isLength("Manowar"))
//-------------------------------------------------------------------

// 4.Напишите функцию, которая принимает два числа и возвращает их сумму.

    //  const isSumNamber = (num1,num2) => num1 + num2

    //  console.log(isSumNamber(-34, -6));
//----------------------------------------------------------------------

// 5.Напишите функцию, которая принимает массив чисел и возвращает новый массив, в котором все числа умножены на 2.

// const arrayNumbers = [1, 5, -7, -88, 9, 44, 15, 35, -5, 10]






//----------------------------------------------------------------

// 6.Напишите функцию, которая принимает массив чисел и возвращает среднее значение.

// const arrayNumbers = [1, 5, -7, -88, 9, 44, 15, 35, -5, 10]
// const isAverage = (arrayNumbers) => {
// const sum = 0

// for (let index = 0; index < arrayNumbers.length; index++) {
//     sum += arrayNumbers[index]    
// }
// }

// const average = sum / arrayNumbers.length
// console.log(isAverage(arrayNumbers));

//---------------------------------------------------------------




    
    





    
         