// 1.Выведите с помощью цикла столбец чисел от 1 до 100

// for(let index =1; index <= 100; index++) {
//     console.log(index);
// }
//--------------------------------------------------

// 3.Выведите с помощью цикла столбец четных чисел от 1 до 100
// 1 способ:
// for (let index = 2; index <= 100; index++) {     
//   if(index % 2 === 0) {
//   console.log(index);
// }
// }

// 2 способ:
// for (let index = 2; index <= 100; index+= 2) {
//     console.log(index);    
// }

//------------------------------------------------------

// 4.Заполните массив 10-ю иксами с помощью цикла
// let array =[]
// for (let index = 0; index < 10 ; index++) {
//     // array[index] = "X"
//     // или так:
//     array.push("X")
// }
// console.log(array);

//------------------------------------------------------

//5.Заполните массив числами от 1 до 10 с помощью цикла

// let array =[]
// for (let index = 1; index <= 10; index++) {
//     array.push(index)    
// }
// console.log(array);
//-------------------------------------------------------

// 6. Заполните массив 10-ю случайными числами (дробями) от 0 до 1 с помощью цикла. Дроби округляйте до двух знаков в дробной части:

// let array = []
// for(let index = 0; index < 10; index += 0.2) {
//     console.log(Math.round(index));
// }
// console.log(array);
//Конец домашки:-----------------------------------------

//------------------ФУНКЦИИ-----------------------------

// Напишите ф-цию и выберете ее-----------------------
// function name() {
//     console.log("Hello");    
// }
// name()

//----------------------------------------------------

//---------напишите функцию которая возвращает строку--
// function test() {
//     return "Creat Btain"
// }
// console.log(test());
//---------------------------------------------------------

//-----напишите функцию которая возвращает возраст ваш---

// function age() {
//     let a = prompt("Write yoyr age")
//     return a
// }
// const result = age
// console.log(age());
//-------------------------------------------------------

//---напишите функцию которая возвращает ваше имя и прибавляет к нему слово “Красавчик/ица”)----------
// function name() {
//     let name = prompt("Write your name");
//     return name + " " + "Красавица";
// }

// console.log(name());
//--------------------------------------------------------

//--напишите функцию которая возвращает ваше имя, прибавляет к нему слово “Красавчик/ица” и прибавляет к этой строке цифру, которую мы тоже передаем в функцию снаружи через аргумент------------------------------------------

// function name (name, age) {
//   let nameAndComp = name + " Красавец" + " " + age
//   return nameAndComp
// }

// console.log(name("Alex", 49));

//---------------------------------------------------------

//--- напишите функцию без аргументов и сохраните ее в переменную а потом сделайте вызов функции из переменной--

// function temp() {
//     console.log("temp");
// }
// let a = temp
// a() // - вызов ф-ции через перепменную!!!!!!!!!!!!!!!
//-------------------------------------------------------

//---напишите функцию с 3мя аргументами и сохраните ее в переменную а потом сделайте вызов функции из переменной---

// let temp = (var1, var2, var3) => {
//    console.log(var1, var2, var3);
// }
// let a = temp
// let b = a
// let c = b
// console.log(c(3, 10, 10));

//---напишите функцию которая в качестве аргумента принимает массив строк и возвращает нам число равное длинне массива------------------------------------------
// const arrayStrings = ["Hello", "Goodbye"]
// const names = ["Anna", "Lesha", "Pavel"]
// const ages = ["18", "23", '35', '46']

// function  giveArrayLength(array) {
//    return array.length  
// }
// console.log(giveArrayLength(arrayStrings),
// giveArrayLength(names),
// giveArrayLength(ages)
// )

//-----------------------------------------------------

//  ---напишите функцию и сохраните ее как свойство объекта, а потом вызовите из объекта через точку----

// const obj = {
//     function(a, b) {
//     return a + b
//   },
  
// }
// const result = obj.function(10, 10)
// console.log(result);

//----------------Св-ва Объукта:-------------------------

const user = {
    age: 20,
}
user.name = "Sergey"
user.age = 35
user.length = 170
user.friends = ["wer", "rytrr"]
user.getMyFrinds = function() {
    return user.friends[0]
}

console.log(user);
//---------------------------------------------------------


