// 1.--- Напиать ф-цию пустую, которая ничего не делает: ----

// const funct = () => {}
// console.log(funct());

//===================================================================

// 2.--- Напишите функцию min(a,b), которая возвращает меньшее из чисел a и b: --------------------------------------

// --- 1 способ: ----------------
// const min = (a,b) => {
//     if(a < b) {
//         return a 
//      } else {
//         return b
//      }
//         }
    
// console.log(min(-560, 123));

// --- 2 способ: -----------------
// const min = (a,b) => a > b ? b : a

// console.log(min(19,-23));

//==================================================================

// 3.--- Написать функцию - которая вернет слово большее по количеству букв. Стрелочная. Принимать в качестве аргументов она должна 2 слова: ---------

// const LengthWord = (word1, word2) => {
//     if(word1.length > word2.length) {
//         return word1
//     } else {
//         return word2
//     }
// }

// console.log(LengthWord('Manowar', 'Metallica'));

//===================================================================


// 4.--- Написать функцию. Стрелочную. Принимает аргементом строку - пароль. Возвращает true если пароль длинее или равен 7 символам. Иначе возвращает false:

// const passExamination = (password) => {
//     if(password.length >=7) {
//         return true
//     } else {
//         return false
//     }
// }

// console.log(passExamination('warlord'));

//===================================================================

// 5. --- Написать стрелочную функцию, которая перебирает массив слов. Массив слов передается через аргумент. И возвращает нам самое длинное слово

const arrayWords = ["Hello", "Goodbye", "Alex", "Revolution", "Svetlana"]



